import { signInAnonymouslyUser, monitorAuthState, signOutUser } from './auth.js';
import {saveData } from './like.js';

document.addEventListener("DOMContentLoaded", () => {
  // Function to handle the initial authentication flow
  const initializeAuth = () => {
    monitorAuthState((user) => {
     // const statusElement = document.getElementById("advice");
      if (user) {
        saveData(user.uid)
        console.log("User is already signed in", user);

     //   statusElement.textContent = `Signed in as ${user.uid}`;
      } else {
        console.log("No user is signed in, signing in anonymously...");
        signInAnonymouslyUser()
          .then((user) => {
        //    statusElement.textContent = `Signed in as ${user.uid}`;
          })
          .catch((error) => {
          //  statusElement.textContent = `Error: ${error.message}`;
          });
      }
    });
  };

  // Initialize authentication
  initializeAuth();

  // Add event listener for the sign-out button if it exists
  const signOutBtn = document.getElementById("signOutBtn");
  if (signOutBtn) {
    signOutBtn.addEventListener("click", () => {
      signOutUser()
        .then(() => {
        //  document.getElementById("advice").innerHTML = "User signed out";
        })
        .catch((error) => {
        //  document.getElementById("advice").innerHTML = `Error: ${error.message}`;
        });
    });
  }
});




const adviceArray = [
    "توكل على الله في كل خطوة.",
    "كن مستعدًا وتنظم وقتك بشكل جيد.",
    "ابتعد عن المماطلة؛ ابدأ مراجعتك مبكرًا.",
    "ضع خطة واضحة للمراجعة.",
    "خذ فترات راحة منتظمة بين جلسات الدراسة.",
    "ثق بنفسك وكون واثقًا في قدراتك.",
    "ابحث عن أساليب دراسة فعالة مثل التلخيص والمراجعة الجماعية.",
    "استخدم التكنولوجيا بشكل ذكي لدعم دراستك.",
    "ابتعد عن المشتتات أثناء الدراسة.",
    "نظم مكان دراستك ليكون مريحًا ومناسبًا.",
    "راجع المواد التي تجدها صعبة بشكل أكثر.",
    "احرص على النوم الجيد لتستعيد طاقتك.",
    "حل الكثير من التمارين التطبيقية خاصة في المواد العلمية.",
    "استمع إلى دروس إضافية عبر الإنترنت إذا كنت بحاجة.",
    "حافظ على صحتك بتناول طعام صحي ومتوازن.",
    "احرص على شرب الماء بشكل كافٍ لتحافظ على نشاطك.",
    "حافظ على إيجابية التفكير مهما كانت الصعوبات.",
    "لا تخجل من طلب المساعدة من المعلمين أو الزملاء.",
    "ضع أهدافًا واضحة لكل أسبوع دراسي.",
    "قسم المواد الكبيرة إلى أجزاء صغيرة لتسهيل دراستها.",
    "اجعل دراسة المواد الصعبة أولوية.",
    "راجع دروسك بشكل مستمر ولا تتركها حتى اللحظات الأخيرة.",
    "كن مرنًا مع جدولك الدراسي حسب الحاجة.",
    "استخدم المراجعة التفاعلية والاختبارات الذاتية.",
    "حدد أولوياتك واعرف ما يجب التركيز عليه.",
    "اعمل على تحسين مهاراتك في حل المشكلات.",
    "احترس من العادات السيئة مثل السهر الطويل.",
    "ضع دائمًا خطة للمراجعة قبل كل امتحان.",
    "تعلم كيفية إدارة الوقت بفعالية.",
    "ابقَ بعيدًا عن أي مصادر تشتت انتباهك أثناء المراجعة.",
    "استرخِ وتجنب التوتر الزائد في فترة الامتحانات.",
    "استخدم أساليب المراجعة الحديثة مثل الخرائط الذهنية.",
    "استفد من الوقت الذي تقضيه في المواصلات بمراجعة المواد.",
    "حاول أن تكون أكثر إبداعًا في كيفية حفظ المعلومات.",
    "تأكد من الحصول على قسط كافٍ من الراحة لتجنب الإرهاق.",
    "ابقَ متحفزًا بمكافأة نفسك عند تحقيق أهداف دراسية.",
    "خلال المراجعة، حدد أهم النقاط التي يجب التركيز عليها.",
    "ابتعد عن الاسترخاء المفرط في الأيام التي تسبق الامتحان.",
    "ركز على فهم المفاهيم بدلاً من الحفظ فقط.",
    "كن مستعدًا نفسيًا وذهنيا للامتحان.",
    "احرص على الالتزام بالمواعيد النهائية.",
    "راجع الامتحانات السابقة لتعرف نمط الأسئلة.",
    "طور مهاراتك في إدارة الإجابة وقت الامتحان.",
    "تجنب الإفراط في تناول المنبهات مثل القهوة.",
    "حافظ على مستوى عالٍ من التركيز أثناء المراجعة.",
    "استغل فترات فراغك في المراجعة السريعة.",
    "كن متفائلًا بما أن كل مجهودك سيؤتي ثماره.",
    "ثق بأن كل ساعة من الدراسة تقربك أكثر من هدفك.",
    "استعد لكل امتحان كما لو كان امتحانك الأخير.",
    "لا تدع الخوف من الفشل يؤثر على أدائك.",
    "اتبع نمطًا ثابتًا في المراجعة كل يوم.",
    "لا تتردد في الاستفسار عن أي نقطة غامضة.",
    "قم بعمل اختبارات ذاتية بشكل دوري.",
    "اجعل المراجعة عملية ممتعة ومثيرة للاهتمام.",
    "حاول أن تدرس في مكان هادئ بعيدًا عن الضوضاء.",
    "احرص على التحدث مع أصدقائك حول المفاهيم الصعبة.",
    "أعد مراجعة الدروس التي كنت تظن أنك قد نسيتها.",
    "ركز على العوامل التي تؤثر في أدائك أثناء الدراسة.",
    "استخدم أساليب الحفظ التكرارية لتثبيت المعلومات.",
    "اعمل على تجنب التشتت أثناء استخدام الإنترنت.",
    "قم بقراءة النصوص بشكل منتظم لتقوية قدرتك على الفهم.",
    "احرص على فهم أسلوب أسئلت الامتحان.",
    "إذا شعرت بالتعب، لا تتردد في أخذ قسط من الراحة.",
    "حافظ على التواصل المستمر مع معلميك وزملائك.",
    "استفد من الأنشطة اللامنهجية لتحسين تركيزك.",
    "احتفظ بدفتر ملاحظات لتنظيم أفكارك.",
    "تعلم كيفية التعامل مع التوتر قبل الامتحانات.",
    "تأكد من الراحة النفسية وتجنب القلق الزائد.",
    "ضع خطة دراسية طويلة المدى لمساعدتك على التفوق.",
    "اختر المواد التي تشعر أنها تناسبك لتكون أكثر فعالية.",
    "لا تهمل الرياضة والأنشطة البدنية أثناء فترة الدراسة.",
    "حاول أن تدرس مع الأصدقاء لتحقيق أفضل استفادة.",
    "احرص على فهم الأخطاء التي قد تقع فيها خلال الامتحانات السابقة.",
    "قم بتحليل أخطائك لتتعلم منها.",
    "لا تدع التقلبات المزاجية تؤثر على أدائك الدراسي.",
    "كن حذرًا في تنظيم وقتك بين المراجعة والنشاطات الأخرى.",
    "ابتعد عن إدمان وسائل التواصل الاجتماعي.",
    "اطلب من معلميك إيضاح النقاط الغامضة.",
    "اجعل الدراسة جزءًا من حياتك اليومية.",
    "تعلم كيفية تكوين وتحديد أهداف واضحة لكل يوم.",
    "استفد من كل فرصة لتحسين مهاراتك في الدراسة.",
    "خلال الامتحانات، قسم وقتك بين الأسئلة بشكل منظم.",
    "إذا شعرت بالضغط النفسي، تواصل مع أصدقائك للحصول على الدعم.",
    "اعتمد على أسلوب الدراسة الفردية حينما تحتاج إلى التركيز.",
    "اختر الوقت الذي تشعر فيه أنك أكثر نشاطًا للدراسة.",
    "خذ فترات قصيرة للمراجعة اليومية.",
    "تجنب الاعتماد على الحفظ الميكانيكي.",
    "استفد من الملاحظات المهمة التي يسجلها المعلمون.",
    "خذ كل امتحان على أنه فرصة لتقديم أفضل ما لديك.",
    "كلما بدأت المراجعة مبكرًا، كلما كانت النتائج أفضل.",
    "احرص على تجنب الإجهاد في الأيام التي تسبق الامتحانات.",
    "تأكد من أنك قد راجعت كل المواد قبل الامتحانات.",
    "حافظ على اتزانك بين الدراسة والنشاطات الاجتماعية.",
    "استمتع بنجاحاتك الصغيرة في كل مرحلة دراسية.",
    "ثق في أنك قادر على التفوق من خلال العمل الجاد.",
    "استخدم كتب المراجعة الخارجية لتوسيع معرفتك.",
    "ركز على المهارات العملية التي يمكن تطبيقها في الامتحانات.",
    "ابحث عن أساليب جديدة لزيادة فعالية دراستك.",
    "خلال فترة الامتحانات، حافظ على التوازن بين الجهد والاستراحة.",
    "استخدم لغة جسدك أثناء الدراسة لتعزيز الذاكرة.",
    "كن مستعدًا نفسيًا لكل امتحان.",
    "ركز في التفاصيل الدقيقة أثناء التحضير.",
    "راجع المواد التي تؤثر على أدائك في الامتحانات السابقة.",
    "قم بإعداد خطة يومية تحتوي على أهداف محددة.",
    "استفد من المراجعة النهائية قبل الامتحانات.",
    "ضع أهدافًا مرحلية لمساعدتك على تحسين أدائك.",
    "لا تتردد في طلب المساعدة عند الحاجة.",
    "اعترف بأخطائك واعتبرها فرصًا للتعلم."
];


function getRandomNumber() {
    return Math.floor(Math.random() * 100) + 1;
}



document.getElementById("advice").innerHTML = adviceArray[getRandomNumber()]